module.exports = {
  INVALID_MOVIE_ID: 'Некорректный id фильма',
  INVALID_USER_ID: 'Некорректный id пользователя',
  TOKEN_NOT_FOUND: ' При авторизации произошла ошибка. Токен не передан или передан не в том формате.',
  INVALID_TOKEN: 'При авторизации произошла ошибка. Переданный токен некорректен.',
  NOT_ENOUGH_PERMISSIONS: 'Не достаточно прав на совершение операции',
  MOVIE_NOT_FOUND: 'Фильм с указанным id не существует.',
  USER_NOT_FOUND: 'Пользователь с указанным id не существует.',
  USER_ALREADY_EXISTS: 'Пользователь с таким email уже существует.',
  INVALID_CREDENTIALS: 'Вы ввели неправильный логин или пароль.',
  INTERNAL: 'На сервере произошла ошибка.',
  ROUTE_NOT_FOUND: 'Страница по указанному маршруту не найдена',
  VALIDATION_ERROR: 'Переданы невалидные данные.',
};
